# ダメージ計算式の検証用ファイル
# 弓の完全版計算式を目指す

# {整数に八捨九入: (武器倍率) x  {小数点第一位に八捨九入: (火事場補正 x 強化太鼓 x 剛力 x **龍気活性** x **攻撃スキル乗算**)}  
#     +  { 鬼人薬G + 鬼人の粉塵 + 力の護符 + 力の爪 + 短期催眠 + 劫血活性 + (怪力の種 or ホムラチョウ) + 攻撃スキル加算 + 伏魔響命青 + 業鎧赤 + 挑戦者 + 逆恨み + 狂竜症 + 災禍転覆 + 連撃 + 攻勢 + 巧撃 + フルチャージ + 逆襲 + 死中に活 + ヒトダマドリ }
# } x { 物理溜め補正 } x { モーション値 / 100 x **百竜装飾品特攻乗算** x **闇討ち** x **弾強化** x ?射撃術属性乗算? x にらみ撃ち物理乗算 x 矢強化物理乗算 x 怒り補正 x 肉質【水やられ補正】/ 100)}
#   x { 強撃ビン補正 x ( 1.0 - (**会心補正** - 1.0) x **(武器会心率 + 鋼龍の魂 + 見切り + 挑戦者 + 奮闘 + 狂竜症 + 攻勢 + 弱点特効 + アミキリアカネ + 強化咆哮)**) }     
# +
# {八捨九入: 
#     {八捨九入: (武器属性値) x  { 劫血活性 x 業鎧 x **属性攻撃強化スキル乗算** x **奮闘** x **炎鱗鋼殻の恩寵** x **龍気活性【天彗龍の魂込み】** }
#     +  { 伏魔響命赤 + 属性攻撃強化スキル加算 + 狂竜症 + 災禍転覆 + 連撃 } 
#     } x { 属性溜め補正 }     
# } x { 属性肉質 / 100 x **劫血活性** x **弱点特効【属性】** x **チャージマスター** x にらみ撃ち属性乗算 x 矢強化属性乗算 x **百竜装飾品弱点特効【属性】** x 怒り補正 }
# x { 1.0 - (**会心撃【属性】補正** - 1.0) x **(武器会心率 + 鋼龍の魂 + 見切り + 挑戦者 + 奮闘 + 狂竜症 + 攻勢 + 弱点特効 + アミキリアカネ + 強化咆哮)** } 



# skill parameter 入力する値
# ダメージが3ずれている どこかの係数が間違っているかも
sp = {
    "攻撃": 7,
    "見切り": 7,
    "伏魔響命・朱": 0,
    "伏魔響命・青": 3,
    "業鎧【修羅】・朱": 0,
    "業鎧【修羅】・青": 3,
    "火属性攻撃強化": 5,
    "水属性攻撃強化": 5,
    "氷属性攻撃強化": 5,
    "雷属性攻撃強化": 5,
    "龍属性攻撃強化": 5,
    "挑戦者": 5,
    "逆恨み": 5,
    "龍気活性": 5,
    "奮闘": 3,
    "狂竜症【蝕】感染": 3,
    "狂竜症【蝕】克服": 0, # 正確には 克服 + (狂竜症なし) の 15% が必要
    "災禍転福": 3,
    "連撃": 3,
    "攻勢": 3,
    "巧撃": 3,
    "闇討ち": 3,
    "フルチャージ": 0,
    "逆襲": 3,
    "死中に活": 3,
    "弱点特効": 3,
    "超会心": 3,
    "弱点特効【属性】": 3,
    "会心撃【属性】": 3,
    "チャージマスター": 3,
    "通常弾・連射矢強化": 3,
    "散弾・拡散矢強化": 0,
    "貫通弾・貫通矢強化": 0,
    "鋼殻の恩恵": 2,
    "炎鱗の恩恵": 2,
}

sp_max = {
    "攻撃": 7,
    "見切り": 7,
    "伏魔響命・朱": 3,
    "伏魔響命・青": 3,
    "業鎧【修羅】・朱": 3,
    "業鎧【修羅】・青": 3,
    "火属性攻撃強化": 5,
    "水属性攻撃強化": 5,
    "氷属性攻撃強化": 5,
    "雷属性攻撃強化": 5,
    "龍属性攻撃強化": 5,
    "挑戦者": 5,
    "逆恨み": 5,
    "龍気活性": 5,
    "奮闘": 3,
    "狂竜症【蝕】感染": 3,
    "狂竜症【蝕】克服": 3,
    "災禍転福": 3,
    "連撃": 3,
    "攻勢": 3,
    "巧撃": 3,
    "闇討ち": 3,
    "フルチャージ": 3,
    "逆襲": 3,
    "死中に活": 3,
    "弱点特効": 3,
    "超会心": 3,
    "弱点特効【属性】": 3,
    "会心撃【属性】": 3,
    "チャージマスター": 3,
    "通常弾・連射矢強化": 3,
    "散弾・拡散矢強化": 3,
    "貫通弾・貫通矢強化": 3,
    "鋼殻の恩恵": 2,
    "炎鱗の恩恵": 2,
}



# binary parameter
bp = {}

for skill in sp:
    bp[skill] = [0] * (sp_max[skill] + 1)
    bp[skill][sp[skill]] = 1

# constant parameter

cp = {
    "武器倍率": 300.0,
    "武器属性値": 30.0,
    "溜め補正物理": 1.35, #溜め4
    "溜め補正属性": 1.2, #溜め4
    "モーション値": 11.0, #連射Lv5
    "肉質": 55.0,
    "ビン補正": 1.35, #強撃ビン
    "武器会心率": 0.0,
    "ヒトダマドリ": 0.0,
    "百竜装飾品特効乗算": 0.0,
    "鋼龍の魂": 0.0, # 0 or 1
    "アミキリアカネ": 0.0, # 0 or 1
    "強化咆哮": 0.0, # 0 or 1
}

print('sp:\n', sp)
print('sp_max:\n', sp_max)
print('bp:\n', bp)
print('cp:\n', cp)


# {整数に八捨九入: (武器倍率) x  {小数点第一位に八捨九入: (火事場補正 x 強化太鼓 x 剛力 x **龍気活性** x **攻撃スキル乗算**)}  
#     +  { 鬼人薬G + 鬼人の粉塵 + 力の護符 + 力の爪 + 短期催眠 + 劫血活性 + (怪力の種 or ホムラチョウ) + 攻撃スキル加算 + 伏魔響命青 + 業鎧赤 + 挑戦者 + 逆恨み + 狂竜症 + 災禍転覆 + 連撃 + 攻勢 + 巧撃 + フルチャージ + 逆襲 + 死中に活 + ヒトダマドリ }
# } x { 物理溜め補正 } x { モーション値 / 100 x **百竜装飾品特攻乗算** x **闇討ち** x **弾強化** x ?射撃術属性乗算? x にらみ撃ち物理乗算 x 矢強化物理乗算 x 怒り補正 x 肉質【水やられ補正】/ 100)}
#   x { 強撃ビン補正 x ( 1.0 - (**会心補正** - 1.0) x **(武器会心率 + 鋼龍の魂 + 見切り + 挑戦者 + 奮闘 + 狂竜症 + 攻勢 + 弱点特効 + アミキリアカネ + 強化咆哮)**) }     
# +
# {八捨九入: 
#     {八捨九入: (武器属性値) x  { 劫血活性 x 業鎧 x **属性攻撃強化スキル乗算** x **奮闘** x **炎鱗鋼殻の恩寵** x **龍気活性【天彗龍の魂込み】** }
#     +  { 伏魔響命赤 + 属性攻撃強化スキル加算 + 狂竜症 + 災禍転覆 + 連撃 } 
#     } x { 属性溜め補正 }     
# } x { 属性肉質 / 100 x **劫血活性** x **弱点特効【属性】** x **チャージマスター** x にらみ撃ち属性乗算 x 矢強化属性乗算 x **百竜装飾品弱点特効【属性】** x 怒り補正 }
# x { 1.0 - (**会心撃【属性】補正** - 1.0) x **(武器会心率 + 鋼龍の魂 + 見切り + 挑戦者 + 奮闘 + 狂竜症 + 攻勢 + 弱点特効 + アミキリアカネ + 強化咆哮)** } 



# ((武器倍率) * (攻撃スキル) + (攻撃スキル加算 + 伏魔響命青 + 逆恨み + 挑戦者)) * (物理溜め補正) * (モーション値 / 100) *(肉質/100) * (強撃ビン補正) *(1.0 + (会心補正 - 1.0) * (武器会心率 + 見切り + 挑戦者 + 奮闘))

MUL1 = cp['武器倍率'] * (1.0 + 0.05*bp['龍気活性'][4] + 0.1*bp['龍気活性'][5]) \
                     * (1.0 + 0.05*bp['攻撃'][4] + 0.06*bp['攻撃'][5] + 0.08*bp['攻撃'][6] + 0.1*bp['攻撃'][7])

ADD = MUL1\
      + 3*bp['攻撃'][1] + 6*bp['攻撃'][2] + 9*bp['攻撃'][3] + 7*bp['攻撃'][4] + 8*bp['攻撃'][5] + 9*bp['攻撃'][6] + 10*bp['攻撃'][7]\
      + 25*bp['伏魔響命・青'][1] + 30*bp['伏魔響命・青'][2] + 35*bp['伏魔響命・青'][3]\
      + 15*bp['業鎧【修羅】・朱'][1] + 25*bp['業鎧【修羅】・朱'][2] + 35*bp['業鎧【修羅】・朱'][3]\
      + 4*bp['挑戦者'][1] + 8*bp['挑戦者'][2] + 12*bp['挑戦者'][3] + 16*bp['挑戦者'][4] + 20*bp['挑戦者'][5]\
      + 5*bp['逆恨み'][1] + 10*bp['逆恨み'][2] + 15*bp['逆恨み'][3] + 20*bp['逆恨み'][4] + 25*bp['逆恨み'][5]\
      + 10*bp['狂竜症【蝕】感染'][1] + 15*bp['狂竜症【蝕】感染'][2] + 20*bp['狂竜症【蝕】感染'][3]\
      + 12*bp['災禍転福'][1] + 15*bp['災禍転福'][2] + 18*bp['災禍転福'][3]\
      + 8*bp['連撃'][1] + 9*bp['連撃'][2] + 10*bp['連撃'][3]\
      + 10*bp['攻勢'][1] + 10*bp['攻勢'][2] + 15*bp['攻勢'][3]\
      + 10*bp['巧撃'][1] + 15*bp['巧撃'][2] + 30*bp['巧撃'][3]\
      + 5*bp['フルチャージ'][1] + 10*bp['フルチャージ'][2] + 20*bp['フルチャージ'][3]\
      + 10*bp['逆襲'][1] + 15*bp['逆襲'][2] + 20*bp['逆襲'][3]\
      + 5*bp['死中に活'][1] + 10*bp['死中に活'][2] + 20*bp['死中に活'][3]\
      + cp['ヒトダマドリ']


AFFR = (min(100.0, cp['武器会心率'] + 15*cp['鋼龍の魂'] \
                    + 5*bp['見切り'][1] + 10*bp['見切り'][2] + 15*bp['見切り'][3] \
                    + 20*bp['見切り'][4] + 25*bp['見切り'][5] + 30*bp['見切り'][6] + 40*bp['見切り'][7] \
                    + 3*bp['挑戦者'][1] + 5*bp['挑戦者'][2] + 7*bp['挑戦者'][3] + 10*bp['挑戦者'][4] + 15*bp['挑戦者'][5] \
                    + 10*bp['奮闘'][1] + 15*bp['奮闘'][2] + 20*bp['奮闘'][3] \
                    + 20*bp['狂竜症【蝕】克服'][1] + 25*bp['狂竜症【蝕】克服'][2] + 25*bp['狂竜症【蝕】克服'][3] \
                    + 10*bp['攻勢'][2] + 20*bp['攻勢'][3] \
                    + 15*bp['弱点特効'][1] + 30*bp['弱点特効'][2] + 50*bp['弱点特効'][3] \
                    + 50*cp['アミキリアカネ'] \
                    + 30*cp['強化咆哮'] \
        ))/100.0 



# 武器会心率 + 鋼龍の魂 + 見切り + 挑戦者 + 奮闘 + 狂竜症 + 攻勢 + 弱点特効 + アミキリアカネ + 強化咆哮

MUL2 = ADD * cp['溜め補正物理'] * (cp['モーション値']/100.0) * (1.0 + 0.05*cp['百竜装飾品特効乗算']) \
       * (1.0 + 0.05*bp['闇討ち'][1] + 0.1*bp['闇討ち'][2] + 0.2*bp['闇討ち'][3]) \
       * (1.0 + 0.05*bp['通常弾・連射矢強化'][1] + 0.1*bp['通常弾・連射矢強化'][2] + 0.2*bp['通常弾・連射矢強化'][3]) \
       * (1.0 + 0.05*bp['散弾・拡散矢強化'][1] + 0.1*bp['散弾・拡散矢強化'][2] + 0.2*bp['散弾・拡散矢強化'][3]) \
       * (1.0 + 0.05*bp['貫通弾・貫通矢強化'][1] + 0.1*bp['貫通弾・貫通矢強化'][2] + 0.2*bp['貫通弾・貫通矢強化'][3]) \
       * (cp['肉質']/100.0) * cp['ビン補正'] \
       * (1.0 + (AFFR) * (1.25 + 0.05*bp['超会心'][1] + 0.1*bp['超会心'][2] + 0.15*bp['超会心'][3] - 1.0))

# 百竜装飾品特攻乗算** x **闇討ち** x **弾強化** x ?射撃術属性乗算? x にらみ撃ち物理乗算 x 矢強化物理乗算 x 怒り補正 x 肉質【水やられ補正】/ 100)}

print('MUL1 =', MUL1)
print('ADD =', ADD)
print('AFFR =', AFFR)
print('MUL2 =', MUL2)




# damage = (300 * (1.0 *(model.AB0 + model.AB1 + model.AB2 + model.AB3) + 1.05 * model.AB4 + 1.06 * model.AB5 + 1.08 * model.AB6 + 1.1 * model.AB7) + 3 * model.AB1 + 6 * model.AB2 + 9 * model.AB3 + 7 * model.AB4 + 8 * model.AB5 + 9 * model.AB6 + 10 * model.AB7 + 15 * model.FUKUMA_AO1 + 20 * model.FUKUMA_AO2 + 25 * model.FUKUMA_AO3 + 4 * model.CHOUSENSHA1 + 8 * model.CHOUSENSHA2 + 12 * model.CHOUSENSHA3 + 16 * model.CHOUSENSHA4 + 20 * model.CHOUSENSHA5 + 5 * model.SAKAURAMI1 + 10 * model.SAKAURAMI2 + 15 * model.SAKAURAMI3 + 20 * model.SAKAURAMI4 + 25 * model.SAKAURAMI5) * (1.35) * (11/100) * (55/100) * (1.35) * (1 + (1.25 * model.CHOUKAISIN0 + 1.30 * model.CHOUKAISIN1 + 1.35 * model.CHOUKAISIN2 + 1.4 * model.CHOUKAISIN3 -1.0) * ((0 + 5 * model.MIKIRI1 + 10 * model.MIKIRI2 + 15 * model.MIKIRI3 + 20 * model.MIKIRI4 + 25 * model.MIKIRI5 + 30 * model.MIKIRI6 + 40 * model.MIKIRI7 + 3 * model.CHOUSENSHA1 + 5 * model.CHOUSENSHA2 + 7 * model.CHOUSENSHA3 + 10 * model.CHOUSENSHA4 + 15 * model.CHOUSENSHA5 + 10 * model.HUNTOU1 + 15 *model.HUNTOU2 + 20 * model.HUNTOU3)/100) )

