# ダメージ計算式の検証用ファイル
# 弓の完全版計算式を目指す
#   - 変数部分の実装はほぼ完了 (検証は少しだけ)

# skill parameter 入力する値
# ダメージが3ずれている どこかの係数が間違っているかも
sp = {
    "攻撃":0,
    "見切り":0,
    "伏魔響命・朱":0,
    "伏魔響命・蒼":0,
    "業鎧【修羅】・朱":0,
    "業鎧【修羅】・蒼":0,
    "火属性攻撃強化":0,
    "水属性攻撃強化":0,
    "氷属性攻撃強化":0,
    "雷属性攻撃強化":0,
    "龍属性攻撃強化":0,
    "挑戦者":0,
    "逆恨み":0,
    "龍気活性":0, # 0-5:01気活性, 6:01気活性
    "奮闘":0,
    "狂竜症【蝕】感染":0,
    "狂竜症【蝕】克服":0, # 正確には 克服 + (狂竜症なし) の 15% が必要
    "災禍転福":0,
    "連撃":0,
    "攻勢":0,
    "巧撃":0,
    "闇討ち":0,
    "フルチャージ":0,
    "逆襲":0,
    "死中に活":0,
    "弱点特効":0,
    "超会心":0,
    "弱点特効【属性】":0,
    "会心撃【属性】":0,
    "チャージマスター":0,
    "通常弾・連射矢強化":0,
    "散弾・拡散矢強化":0,
    "貫通弾・貫通矢強化":0,
    "渾身":0,
    "鋼殻の恩恵":0,
    "炎鱗の恩恵":0,
}


input_dict = \
{'業鎧【修羅】': 1, '弱点特効': 3, '見切り': 2, '渾身': 3, '災禍転福': 1, '逆襲': 2, '奮闘': 1, '超会心': 3, '連撃': 1, 'フルチャージ': 3, '逆恨み': 2, '通常弾・連射矢強化': 3, '弾導強化': 1, '装填速度': 2, ' 弓溜め段階解放': 1}
# {'チャージマスター': 3, '伏魔響命': 3, '見切り': 2, '炎鱗の恩恵': 1, '火属性攻撃強化': 5, '連撃': 3, '災禍転福': 2, '会心撃【属性】': 1, '奮闘': 1, '弱点特効【属性】': 2, '弾導強化': 1, '装填速度': 2, '弓溜め 段階解放': 1, '通常弾・連射矢強化': 3}


for key in input_dict:
    if '業鎧【修羅】' in key:
        sp['業鎧【修羅】・朱'] = input_dict[key]
    elif '伏魔' in key:
        sp['伏魔響命・朱'] = input_dict[key]
    elif '狂竜症' in key:
        sp['狂竜症【蝕】感染'] = input_dict[key]
    else:
        if key in sp:
            sp[key] = input_dict[key]


sp_max = {
    "攻撃": 7,
    "見切り": 7,
    "伏魔響命・朱": 3,
    "伏魔響命・蒼": 3,
    "業鎧【修羅】・朱": 3,
    "業鎧【修羅】・蒼": 3,
    "火属性攻撃強化": 5,
    "水属性攻撃強化": 5,
    "氷属性攻撃強化": 5,
    "雷属性攻撃強化": 5,
    "龍属性攻撃強化": 5,
    "挑戦者": 5,
    "逆恨み": 5,
    "龍気活性": 5,
    "奮闘": 3,
    "狂竜症【蝕】感染": 3,
    "狂竜症【蝕】克服": 3,
    "災禍転福": 3,
    "連撃": 3,
    "攻勢": 3,
    "巧撃": 3,
    "闇討ち": 3,
    "フルチャージ": 3,
    "逆襲": 3,
    "死中に活": 3,
    "弱点特効": 3,
    "超会心": 3,
    "弱点特効【属性】": 3,
    "会心撃【属性】": 3,
    "チャージマスター": 3,
    "通常弾・連射矢強化": 3,
    "散弾・拡散矢強化": 3,
    "貫通弾・貫通矢強化": 3,
    "渾身": 3,
    "鋼殻の恩恵": 2,
    "炎鱗の恩恵": 2,
}



# binary parameter
bp = {}

for skill in sp:
    bp[skill] = [0] * (sp_max[skill] + 1)
    bp[skill][sp[skill]] = 1

# constant parameter

cp = {
    "武器倍率": 300.0,
    "武器属性値": 30.0,
    "溜め補正物理": 1.35, #溜め4
    "溜め補正属性": 1.2, #溜め4
    "モーション値": 11.0, #連射Lv5
    "物理肉質": 55.0,
    "属性肉質": 30.0,
    "ビン補正": 1.35, #強撃ビン
    "武器会心率": 0.0,
    "ヒトダマドリ": 0.0,
    "百竜装飾品特効乗算": 0.0,
    "鋼龍の魂": 0.0, # 0 or 1
    "アミキリアカネ": 0.0, # 0 or 1
    "強化咆哮": 0.0, # 0 or 1
    "劫血活性": [1.0, 0.0, 0.0], # 0 or 1
    "怒り補正": 1.0, # 0 or 1
    "百竜装飾品" : {"弱点特効【属性】": 0, "種系特効": 0, "やられ特効": 0, "劫血活性": 0, "鋼龍の魂": 0, "天彗龍の魂": 0}
    # 矢強化
    # 剛力
    # にらみ撃ち
    # 百竜装飾品
    # 火事場
    # 強化太鼓
    # バフアイテム
    # 射撃術
}

print('sp:\n', sp)
print('sp_max:\n', sp_max)
print('bp:\n', bp)
print('cp:\n', cp)


# {整数に八捨九入: (武器倍率) x  {小数点第一位に八捨九入: (火事場補正 x 強化太鼓 x 剛力 x **龍気活性** x **攻撃スキル乗算**)}  
#     +  { 鬼人薬G + 鬼人の粉塵 + 力の護符 + 力の爪 + 短期催眠 + 劫血活性 + (怪力の種 or ホムラチョウ) + 攻撃スキル加算 + 伏魔響命蒼 + 業鎧赤 + 挑戦者 + 逆恨み + 狂竜症 + 災禍転覆 + 連撃 + 攻勢 + 巧撃 + フルチャージ + 逆襲 + 死中に活 + 劫血活性加算 + ヒトダマドリ }
# } x { 物理溜め補正 } x { モーション値 / 100 x **百竜装飾品特攻乗算** x **闇討ち** x **弾強化** x ?射撃術属性乗算? x にらみ撃ち物理乗算 x 矢強化物理乗算 x 怒り補正 x 肉質【水やられ補正】/ 100)}
#   x { 強撃ビン補正 x ( 1.0 + (**会心補正** - 1.0) x **(武器会心率 + 鋼龍の魂 + 見切り + 挑戦者 + 奮闘 + 狂竜症 + 攻勢 + 弱点特効 + アミキリアカネ + 強化咆哮)**) }     
# +
# {八捨九入: 
#     {八捨九入: (武器属性値) x  { 劫血活性 x 業鎧 x **属性攻撃強化スキル乗算** x **奮闘** x **炎鱗鋼殻の恩寵** x **龍気活性【天彗龍の魂込み】** }
#     +  { 伏魔響命赤 + 属性攻撃強化スキル加算 + 狂竜症 + 災禍転覆 + 連撃 } 
#     } x { 属性溜め補正 }     
# } x { 属性肉質 / 100 x **劫血活性** x **弱点特効【属性】** x **チャージマスター** x にらみ撃ち属性乗算 x 矢強化属性乗算 x **百竜装飾品弱点特効【属性】** x 怒り補正 }
# x { 1.0 + (**会心撃【属性】補正** - 1.0) x **(武器会心率 + 鋼龍の魂 + 見切り + 挑戦者 + 奮闘 + 狂竜症 + 攻勢 + 弱点特効 + アミキリアカネ + 強化咆哮)** } 



# ((武器倍率) * (攻撃スキル) + (攻撃スキル加算 + 伏魔響命蒼 + 逆恨み + 挑戦者)) * (物理溜め補正) * (モーション値 / 100) *(肉質/100) * (強撃ビン補正) *(1.0 + (会心補正 - 1.0) * (武器会心率 + 見切り + 挑戦者 + 奮闘))

P_MUL1 = cp['武器倍率'] \
            * (1.0 + 0.3*cp['お団子火事場力'][1] +0.35*cp['お団子火事場力'][2]) \ add
            * (1.0 + 0.05*cp['強化太鼓の技'][1]) \ add
            * (1.0 + 0.1*cp['剛力の弓がけ'][1]) \ add
            * (1.0 + 0.05*cp['龍気活性'][4] + 0.1*cp['龍気活性'][5]) \
            * (1.0 + 0.05*cp['攻撃'][4] + 0.06*cp['攻撃'][5] + 0.08*cp['攻撃'][6] + 0.1*cp['攻撃'][7]) 

P_ADD = P_MUL1\
      + 5*cp['鬼人薬'][1] + 7*cp['鬼人薬'][2] \ add
      + 6*cp['力の護符'][1] \ add
      + 9*cp['力の爪'][1] \ add
      + 10*cp['種ホムラ'][1] + 25*cp['種ホムラ'][2] \ add
      + 10*cp['鬼人の粉塵'][1] \ add
      + 6*cp['短期催眠'][1] + 9*cp['短期催眠'][2] + 12*cp['短期催眠'][3] + 15*cp['短期催眠'][4] \ add
      + 15*cp['劫血活性'][1] + 30*cp['劫血活性'][2] \ add
      + cp['ヒトダマドリ'] \ add
      + 3*bp['攻撃'][1] + 6*bp['攻撃'][2] + 9*bp['攻撃'][3] + 7*bp['攻撃'][4] + 8*bp['攻撃'][5] + 9*bp['攻撃'][6] + 10*bp['攻撃'][7]\
      + 25*bp['伏魔響命・蒼'][1] + 30*bp['伏魔響命・蒼'][2] + 35*bp['伏魔響命・蒼'][3]\
      + 15*bp['業鎧【修羅】・朱'][1] + 25*bp['業鎧【修羅】・朱'][2] + 35*bp['業鎧【修羅】・朱'][3]\
      + 4*bp['挑戦者'][1] + 8*bp['挑戦者'][2] + 12*bp['挑戦者'][3] + 16*bp['挑戦者'][4] + 20*bp['挑戦者'][5]\
      + 5*bp['逆恨み'][1] + 10*bp['逆恨み'][2] + 15*bp['逆恨み'][3] + 20*bp['逆恨み'][4] + 25*bp['逆恨み'][5]\
      + 10*bp['狂竜症【蝕】感染'][1] + 15*bp['狂竜症【蝕】感染'][2] + 20*bp['狂竜症【蝕】感染'][3]\
      + 12*bp['災禍転福'][1] + 15*bp['災禍転福'][2] + 18*bp['災禍転福'][3]\
      + 8*bp['連撃'][1] + 9*bp['連撃'][2] + 10*bp['連撃'][3]\
      + 10*bp['攻勢'][1] + 10*bp['攻勢'][2] + 15*bp['攻勢'][3]\
      + 10*bp['巧撃'][1] + 15*bp['巧撃'][2] + 30*bp['巧撃'][3]\
      + 5*bp['フルチャージ'][1] + 10*bp['フルチャージ'][2] + 20*bp['フルチャージ'][3]\
      + 10*bp['逆襲'][1] + 15*bp['逆襲'][2] + 20*bp['逆襲'][3]\
      + 5*bp['死中に活'][1] + 10*bp['死中に活'][2] + 20*bp['死中に活'][3]\

# Affinity Rate
AFR = (min(100.0, cp['武器会心率'] \
                    + 15*cp['百竜装飾品']['鋼龍の魂'] \ add
                    + 5*bp['見切り'][1] + 10*bp['見切り'][2] + 15*bp['見切り'][3] \
                    + 20*bp['見切り'][4] + 25*bp['見切り'][5] + 30*bp['見切り'][6] + 40*bp['見切り'][7] \
                    + 3*bp['挑戦者'][1] + 5*bp['挑戦者'][2] + 7*bp['挑戦者'][3] + 10*bp['挑戦者'][4] + 15*bp['挑戦者'][5] \
                    + 10*bp['奮闘'][1] + 15*bp['奮闘'][2] + 20*bp['奮闘'][3] \
                    + 20*bp['狂竜症【蝕】克服'][1] + 25*bp['狂竜症【蝕】克服'][2] + 25*bp['狂竜症【蝕】克服'][3] \
                    + 10*bp['攻勢'][2] + 20*bp['攻勢'][3] \
                    + 15*bp['弱点特効'][1] + 30*bp['弱点特効'][2] + 50*bp['弱点特効'][3] \
                    + 10*bp['渾身'][1] + 20*bp['渾身'][2] + 30*bp['渾身'][3] \
                    + 50*cp['アミキリアカネ'] \
                    + 30*cp['強化咆哮'] \
        ))/100.0 



# 武器会心率 + 鋼龍の魂 + 見切り + 挑戦者 + 奮闘 + 狂竜症 + 攻勢 + 弱点特効 + アミキリアカネ + 強化咆哮

P_MUL2 = P_ADD * cp['溜め補正物理'] * (cp['モーション値']/100.0) 
       * (1.0 + 0.05*cp['百竜装飾品']['種系特効']) \ add
       * (1.0 + 0.1*cp['百竜装飾品']['やられ特効']) \ add
       * (1.0 + 0.05*bp['闇討ち'][1] + 0.1*bp['闇討ち'][2] + 0.2*bp['闇討ち'][3]) \
       * (1.0 + 0.05*bp['通常弾・連射矢強化'][1] + 0.1*bp['通常弾・連射矢強化'][2] + 0.2*bp['通常弾・連射矢強化'][3]) \
       * (1.0 + 0.05*bp['散弾・拡散矢強化'][1] + 0.1*bp['散弾・拡散矢強化'][2] + 0.2*bp['散弾・拡散矢強化'][3]) \
       * (1.0 + 0.05*bp['貫通弾・貫通矢強化'][1] + 0.1*bp['貫通弾・貫通矢強化'][2] + 0.2*bp['貫通弾・貫通矢強化'][3]) \
       * (cp['物理肉質']/100.0) * cp['ビン補正'] \
       * (1.3*cp['にらみ撃ち']) \ add
       * (1.15*cp['矢強化']) \ add
       * (1.0 + 0.01*cp['射撃術'][1] + 0.02*cp['射撃術'][2] + 0.03*cp['射撃術'][3] + 0.04*cp['射撃術'][4]) \ add 期待値ダメ計算未検証
       * (1.0 + (AFR) * (1.25 + 0.05*bp['超会心'][1] + 0.1*bp['超会心'][2] + 0.15*bp['超会心'][3] - 1.0))

# 百竜装飾品特攻乗算** x **闇討ち** x **弾強化** x ?射撃術属性乗算? x にらみ撃ち物理乗算 x 矢強化物理乗算 x 怒り補正 x 肉質【水やられ補正】/ 100)}


# 龍気活性【天彗龍の魂込】 倍率は3種類 {0, 1, 1.2}
# if 龍気活性 >= 1:
#     if 龍属性武器 :
#         if 天彗龍の魂:
#             1.2倍
#         else:
#             1倍
#     else:
#         0倍
# else:
#     1倍

# 変数は減るが非線形になる書き方 
# * (1.0 + 0.05*bp['業鎧【修羅】・蒼'] +  0.1*bp['業鎧【修羅】・蒼'] +  0.2*bp['業鎧【修羅】・蒼'] )



E_MUL1 = cp['武器属性値'] \
        * (1.0 + 0.1*cp['百竜装飾品']['劫血活性'][1] + 0.2*cp['百竜装飾品']['劫血活性'][2]) \ add
        * (1.0 + 0.05*bp['業鎧【修羅】・蒼'][1] +  0.1*bp['業鎧【修羅】・蒼'][2] +  0.2*bp['業鎧【修羅】・蒼'][3]) \
        * (1.0 + 0.05*bp['火属性攻撃強化'][3] +  0.1*bp['火属性攻撃強化'][4] +  0.2*bp['火属性攻撃強化'][5]) \
        * (1.0 + 0.05*bp['水属性攻撃強化'][3] +  0.1*bp['水属性攻撃強化'][4] +  0.2*bp['水属性攻撃強化'][5]) \
        * (1.0 + 0.05*bp['氷属性攻撃強化'][3] +  0.1*bp['氷属性攻撃強化'][4] +  0.2*bp['氷属性攻撃強化'][5]) \
        * (1.0 + 0.05*bp['雷属性攻撃強化'][3] +  0.1*bp['雷属性攻撃強化'][4] +  0.2*bp['雷属性攻撃強化'][5]) \
        * (1.0 + 0.05*bp['龍属性攻撃強化'][3] +  0.1*bp['龍属性攻撃強化'][4] +  0.2*bp['龍属性攻撃強化'][5]) \
        * (1.0 + 0.1*bp['奮闘'][1] +  0.15*bp['奮闘'][2] +  0.2*bp['奮闘'][3]) \
        * (1.2*bp['百竜装飾品']['天彗龍の魂']) \ add
        * (1.0 + 0.05*bp['鋼殻の恩恵'][1] +  0.1*bp['鋼殻の恩恵'][2]) \
        * (1.0 + 0.05*bp['炎鱗の恩恵'][1] +  0.1*bp['炎鱗の恩恵'][2]) \

E_ADD = 0.0 if round(E_MUL1) == 0 else E_MUL1 \
        + 12*bp['伏魔響命・朱'][1] + 15*bp['伏魔響命・朱'][2] + 20*bp['伏魔響命・朱'][3]\
        + 2*bp['火属性攻撃強化'][1] +  3*bp['火属性攻撃強化'][2] +  4*bp['火属性攻撃強化'][3] + 4*bp['火属性攻撃強化'][4] +  4*bp['火属性攻撃強化'][5] \
        + 2*bp['水属性攻撃強化'][1] +  3*bp['水属性攻撃強化'][2] +  4*bp['水属性攻撃強化'][3] + 4*bp['水属性攻撃強化'][4] +  4*bp['水属性攻撃強化'][5] \
        + 2*bp['氷属性攻撃強化'][1] +  3*bp['氷属性攻撃強化'][2] +  4*bp['氷属性攻撃強化'][3] + 4*bp['氷属性攻撃強化'][4] +  4*bp['氷属性攻撃強化'][5] \
        + 2*bp['雷属性攻撃強化'][1] +  3*bp['雷属性攻撃強化'][2] +  4*bp['雷属性攻撃強化'][3] + 4*bp['雷属性攻撃強化'][4] +  4*bp['雷属性攻撃強化'][5] \
        + 2*bp['龍属性攻撃強化'][1] +  3*bp['龍属性攻撃強化'][2] +  4*bp['龍属性攻撃強化'][3] + 4*bp['龍属性攻撃強化'][4] +  4*bp['龍属性攻撃強化'][5] \
        + 5*bp['狂竜症【蝕】感染'][1] + 7*bp['狂竜症【蝕】感染'][2] + 10*bp['狂竜症【蝕】感染'][3] \
        + 2*bp['災禍転福'][1] + 3*bp['災禍転福'][2] + 4*bp['災禍転福'][3] \
        + 6*bp['連撃'][1] + 8*bp['連撃'][2] + 10*bp['連撃'][3] \

E_MUL2 = E_ADD * cp['溜め補正属性'] * cp['属性肉質'] / 100.0 \
        * (1.0 + 0.1*bp['弱点特効【属性】'][1] + 0.125*bp['弱点特効【属性】'][2] + 0.15*bp['弱点特効【属性】'][3]) \
        * (1.0 + 0.05*bp['チャージマスター'][1] + 0.1*bp['チャージマスター'][2] + 0.15*bp['チャージマスター'][3]) \
        * cp['怒り補正'] \
        * (1.0 + 0.1*cp['百竜装飾品']['劫血活性'][1] + 0.2*cp['百竜装飾品']['劫血活性'][2]) \ add
        * (1.15*cp['矢強化']) \ add
        * (1.3*cp['にらみ撃ち']) \ add
        * (1.15*cp['百竜装飾品']['弱点特効【属性】']) \ add
        * (1.0 + AFR * (1.0 + 0.05*bp['会心撃【属性】'][1] + 0.1*bp['会心撃【属性】'][2] + 0.15*bp['会心撃【属性】'][3] - 1.0))


 
# {八捨九入: 
#     {八捨九入: (武器属性値) x  { 劫血活性 x 業鎧 x **属性攻撃強化スキル乗算** x **奮闘** x **炎鱗鋼殻の恩寵** x **龍気活性【天彗龍の魂込み】** }
#     +  { 伏魔響命赤 + 属性攻撃強化スキル加算 + 狂竜症 + 災禍転覆 + 連撃 } 
#     } x { 属性溜め補正 }     
# } x { 属性肉質 / 100 x **弱点特効【属性】** x **チャージマスター** x にらみ撃ち属性乗算 x 矢強化属性乗算 x **百竜装飾品弱点特効【属性】** x 怒り補正 }
# x { 1.0 + (**会心撃【属性】補正** - 1.0) x **(武器会心率 + 鋼龍の魂 + 見切り + 挑戦者 + 奮闘 + 狂竜症 + 攻勢 + 弱点特効 + アミキリアカネ + 強化咆哮)** } 

print('AFR =', AFR)

print('\nP_MUL1 =', P_MUL1)
print('P_ADD =', P_ADD)
print('P_MUL2 =', P_MUL2)

print('\nE_MUL1 =', E_MUL1)
print('E_ADD =', E_ADD)
print('E_MUL2 =', E_MUL2)

print('\nRESULT = P_MUL2 + E_MUL2\n   ', P_MUL2 + E_MUL2)
