# dmax 用の入力データ

input_data = {
    # パラメータ
    "武器倍率": 300.0,
    "武器属性値": 30.0,
    "武器会心率": 0.0,
    "溜め補正物理": 1.35, #溜め4
    "溜め補正属性": 1.2, #溜め4
    "モーション値": 11.0, #連射Lv5
    "ビン補正": 1.35, #強撃ビン

    "物理肉質": 55.0,
    "属性肉質": 30.0,
    "属性": 1, # 0: 無属性, 1: 火, 2:水, 3:氷, 4:雷, 5:龍

    "百竜装飾品" : {"弱点特効【属性】": 0, "種系特効": 0, "やられ特効": 0, "劫血活性": [0, 0, 0], "鋼龍の魂": 0, "天彗龍の魂": 0},
    "矢強化": 0,
    "剛力の弓がけ": 0,
    "ヒトダマドリ": 0.0,
    "アミキリアカネ": 0, # 0 or 1
    "強化咆哮": 0, # 0 or 1
    "鬼人薬": [0, 0, 0], # 0: なし, 1: 鬼人薬, 2: 鬼人薬G
    "力の護符": 0,
    "力の爪": 0,
    "種ホムラ": [0, 0, 0], # 0: なし, 1: 怪力の種, 2: ホムラチョウ
    "鬼人の粉塵": 0,
    "お団子火事場力": [0, 0, 0],
    "強化太鼓の技": 0,
    "にらみ撃ち": 0,
    "射撃術": [0, 0, 0, 0, 0],
    "短期催眠": [0, 0, 0, 0, 0],
    "怒り補正": 1.0, 

    # -1: 除外スキル
    "damage_skills": {
        "攻勢": -1,
        "フルチャージ": -1,
        "逆襲": -1,
        "死中に活": -1,
        "龍気活性": 0, # 0-51気活性, 61気活性
        "攻撃": 0,
        "見切り": 0,
        "伏魔響命": 0,
        "業鎧【修羅】": 0,
        "火属性攻撃強化": 0,
        "水属性攻撃強化": 0,
        "氷属性攻撃強化": 0,
        "雷属性攻撃強化": 0,
        "龍属性攻撃強化": 0,
        "挑戦者": 0,
        "逆恨み": 0,
        "奮闘": 0,
        "狂竜症【蝕】": 0, # 正確には 克服 + (狂竜症なし) の 15% も必要
        "災禍転福": 0,
        "連撃": 0,
        "巧撃": 0,
        "闇討ち": 0,
        "弱点特効": 0,
        "超会心": 0,
        "弱点特効【属性】": 0,
        "会心撃【属性】": 0,
        "チャージマスター": 0,
        "通常弾・連射矢強化": 0,
        "散弾・拡散矢強化": 0,
        "貫通弾・貫通矢強化": 0,
        "鋼殻の恩恵": 0,
        "炎鱗の恩恵": 0,
    }

    # 必須スキル
    'required_skills': {
        # 'スタミナ急速回復': 3, '体術': 2, '攻撃': 4, '氷属性攻撃強化': 5, '弱点特効': 3, '超会心': 3, '通常弾・連射矢強化': 3, '弾導強化': 1, '装填速度': 2, '弓溜め段階解放': 1,

        '通常弾・連射矢強化': 3,
        '弾導強化': 1,
        '装填速度': 2,
        '弓溜め段階解放': 1,
        # '奮闘': 3,

        # '弱点特効': 3,
        # '超会心': 3,
        # '伏魔響命': 3,
        # '奮闘': 3,
        # '攻撃': 2,
        # '見切り': 7,
        # '氷属性攻撃強化': 5,

        # '風纏': 3,
        # '弓溜め段階解放':1, '奮闘':3, '狂化':1, '伏魔響命':2, '見切り':6, '逆恨み':3, '超会心':2, '弱点特効【属性】':1, '狂竜症【蝕】':1, '災禍転福':3, '弱点特効':3, '通常弾・連射矢強化':3, '氷属性攻撃強化':3
        # '弱点特効':3, '攻撃':7, '見切り':3, '超会心':3, '納刀術':3, '翔蟲使い':3, '鋼殻の恩恵':3, '風纏':1, '粉塵纏':1, '連撃':1, 'フルチャージ':1, '渾身':2, '風圧耐性':3
        # '弱点特効':3, '超会心':3, '翔蟲使い':3, '顕如盤石':3, '砲弾装填':2, '攻撃':4, '研磨術【鋭】':1, '弱点特効【属性】':1, 'チャージマスター':2, '会心撃【属性】':2, '逆恨み':2, '弾丸節約':2, '笛吹き名人':1
    }
}